app/controllers/api/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 1111]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "users" ORDER BY "users"."id" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
    def index
      @users = User.order(:id).limit(USERS_PER_PAGE).offset(page * 4)
      @total = User.all.count

INSERT INTO "users" ("name", "zawod", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Testujemyyy "], ["zawod", "TESTER"], ["created_at", "2020-04-13 18:59:01.883605"], ["updated_at", "2020-04-13 18:59:01.883605"]]
---
    def create
      @user = User.new(user_params)
      if @user.save